In [1]:
import pandas as pd

Operations:
    -slicing
    -merging and joining
    -concatenation
    -changing the index
    -change the column
    -Data Munging

In [2]:
#Creating a Dictonary

web = {"Day" : [1, 2, 3, 4, 5, 6], "Visitors" : [1200, 700, 5500, 540, 400, 340], "bounceRate" : [20, 30, 22, 15, 10, 35]}

In [3]:
web

{'Day': [1, 2, 3, 4, 5, 6],
 'Visitors': [1200, 700, 5500, 540, 400, 340],
 'bounceRate': [20, 30, 22, 15, 10, 35]}

In [4]:
type(web)

dict

In [6]:
#Creating a Pandas Dataframe

df = pd.DataFrame(web)

In [7]:
df

   Day  Visitors  bounceRate
0    1      1200          20
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10
5    6       340          35

In [8]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.head() #Showing only the top 5 of the dataframe

   Day  Visitors  bounceRate
0    1      1200          20
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10

In [11]:
df.tail() #Showing only last 5 of the dataframe

   Day  Visitors  bounceRate
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10
5    6       340          35

In [12]:
print(df)

   Day  Visitors  bounceRate
0    1      1200          20
1    2       700          30
2    3      5500          22
3    4       540          15
4    5       400          10
5    6       340          35

# Merging and Joining

In [18]:
df1 = pd.DataFrame({"HPI" : [90, 70, 60, 80], "Int_rate" : [2, 3, 1, 2], "Ind_gdp" : [50, 35, 40, 45], "year" : [2015, 2016, 2017, 2018]})

In [19]:
df1

   HPI  Int_rate  Ind_gdp  year
0   90         2       50  2015
1   70         3       35  2016
2   60         1       40  2017
3   80         2       45  2018

In [25]:
df2 = pd.DataFrame({"HPI" : [90, 70, 60, 80], "Int_rate" : [2, 3, 1, 2], "Ind_gdp" : [50, 35, 40, 45], "year" : [2005, 2006, 2007, 2008]})

In [26]:
df2

   HPI  Int_rate  Ind_gdp  year
0   90         2       50  2005
1   70         3       35  2006
2   60         1       40  2007
3   80         2       45  2008

In [32]:
#Not working because we have to say one what feature(column) basis we need to merge

mer = pd.merge(df1, df2)

In [28]:
mer

Empty DataFrame
Columns: [HPI, Int_rate, Ind_gdp, year]
Index: []

In [33]:
#like this, here we are merging with respect to HPI

merge = pd.merge(df1, df2, on="HPI")

In [34]:
merge

   HPI  Int_rate_x  Ind_gdp_x  year_x  Int_rate_y  Ind_gdp_y  year_y
0   90           2         50    2015           2         50    2005
1   70           3         35    2016           3         35    2006
2   60           1         40    2017           1         40    2007
3   80           2         45    2018           2         45    2008

In [36]:
df3 = pd.DataFrame({"Ind_Rate" : [2, 1, 2, 3], "Ind_gdp" : [50, 45, 35, 65], "year" : [2016, 2017, 2018, 2019]})

In [37]:
df3

   Ind_Rate  Ind_gdp  year
0         2       50  2016
1         1       45  2017
2         2       35  2018
3         3       65  2019

In [45]:
df4 =  pd.DataFrame({"low_Tier" : [50, 45, 35, 65], "UnEmployment" : [1, 3, 5, 7], "year1" : [2006, 2021, 2022, 2013]})

In [46]:
df4

   low_Tier  UnEmployment  year1
0        50             1   2006
1        45             3   2021
2        35             5   2022
3        65             7   2013

In [47]:
join = df3.join(df4)

In [48]:
join

   Ind_Rate  Ind_gdp  year  low_Tier  UnEmployment  year1
0         2       50  2016        50             1   2006
1         1       45  2017        45             3   2021
2         2       35  2018        35             5   2022
3         3       65  2019        65             7   2013

# Concatenation

In [49]:
df5 = pd.DataFrame({"HPI" : [90, 70, 60, 80], "Int_rate" : [2, 3, 1, 2], "Ind_gdp" : [50, 35, 40, 45], "year" : [2015, 2016, 2017, 2018]})
df6 = pd.DataFrame({"HPI" : [90, 70, 60, 80], "Int_rate" : [2, 3, 1, 2], "Ind_gdp" : [50, 35, 40, 45], "year" : [2005, 2006, 2007, 2008]})

In [50]:
concat = pd.concat([df5, df6])

In [51]:
concat

   HPI  Int_rate  Ind_gdp  year
0   90         2       50  2015
1   70         3       35  2016
2   60         1       40  2017
3   80         2       45  2018
0   90         2       50  2005
1   70         3       35  2006
2   60         1       40  2007
3   80         2       45  2008

In [52]:
concat1 = pd.concat([df5, df6], axis = 1)

In [53]:
concat1

   HPI  Int_rate  Ind_gdp  year  HPI  Int_rate  Ind_gdp  year
0   90         2       50  2015   90         2       50  2005
1   70         3       35  2016   70         3       35  2006
2   60         1       40  2017   60         1       40  2007
3   80         2       45  2018   80         2       45  2008

In [ ]:
#Setting the index

In [54]:
df1 = pd.DataFrame({"Day" : [1, 2, 3, 4], "Visitors" : [200, 120, 300, 350], "BounceRate" : [20, 35, 45, 55]})

In [55]:
df1.set_index("Day", inplace = True)

In [56]:
df1

     Visitors  BounceRate
Day
1         200          20
2         120          35
3         300          45
4         350          55

In [57]:
#renaming the feature name

df1 = df1.rename(columns={"Visitors":"Users"})

In [58]:
df1

     Users  BounceRate
Day
1      200          20
2      120          35
3      300          45
4      350          55


# PANDAS Series

In [59]:
s = pd.Series()

<ipython-input-59-399a7d257b44>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

In [60]:
s

Series([], dtype: float64)

In [61]:
import numpy as np

In [62]:
data = np.array(["a", "b", "c", "d"])

In [63]:
data

array(['a', 'b', 'c', 'd'], dtype='<U1')

In [64]:
x = pd.Series(data)

In [65]:
x

0    a
1    b
2    c
3    d
dtype: object

In [66]:
data = {"a" : 12, "b" : 25 ,"c" : 35}

In [67]:
x = pd.Series(data)

In [68]:
x

a    12
b    25
c    35
dtype: int64

In [69]:
exam_data = {"Student" : ["Shivam", "Shasank", "Saurab", "Suryansh", "Venkatesh"],
             "Rank" : [1, 2, 3, 2, 3],
             "Year" : [2013, 2013, 2014, 2015, 2016],
             "Marks" : [850, 740, 890, 670, 810]}

In [70]:
df = pd.DataFrame(exam_data)

In [71]:
df

     Student  Rank  Year  Marks
0     Shivam     1  2013    850
1    Shasank     2  2013    740
2     Saurab     3  2014    890
3   Suryansh     2  2015    670
4  Venkatesh     3  2016    810

In [ ]:
#groupBy Method

In [72]:
print(df.groupby("Student"))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000029FE1A80370>

In [73]:
print(df.groupby("Student").groups)

{'Saurab': Int64Index([2], dtype='int64'), 'Shasank': Int64Index([1], dtype='int64'), 'Shivam': Int64Index([0], dtype='int64'), 'Suryansh': Int64Index([3], dtype='int64'), 'Venkatesh': Int64Index([4], dtype='int64')}

In [74]:
df.groupby("Student").groups

{'Saurab': Int64Index([2], dtype='int64'),
 'Shasank': Int64Index([1], dtype='int64'),
 'Shivam': Int64Index([0], dtype='int64'),
 'Suryansh': Int64Index([3], dtype='int64'),
 'Venkatesh': Int64Index([4], dtype='int64')}